{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
	      "Juan",
	      "Hello Juan",
	      "Hi Juan"
      ],
      "responses": [
    	"Hello my name is Juan, what can I do for you?",
    	"Hello, how can I assist you?",
    	"Hi, I am Juan La Salle. The only Juan you need. How can I be of assistance?",
    	"Hello, is there anything I can help you with?",
	    "Good day. I am your Digital Assistant, Juan. How can I help."
      ]
    },
    {
    "tag": "Your Name",
          "patterns": [
	 "What is your name?",
	 "Who are you?",
	 "What are you?",
	 "Are you a robot?",
	 "What do your do?"
	 ],
	  "responses": [
	 "Hi I am Juan, short for Just a University Assistant powered by a Neural Network. I am a brain child of David Yabis, Isobelle Casado, and James Rafols from BCS32. I am a chatbot made to answer your questions :))))."
	 ]
    }, 
    {
      "tag": "General Kenobi",
      "patterns": [
        "Hello There"
      ],
      "responses": [
        "General Kenobi ;)"
      ]
    },


    {
      "tag": "PreReg",
      "patterns": [
        "Why is there a need to pre-register",
        "Why do I need to pre-register",
        "Why is there a need to pre register",
        "Why do I need to pre register",
        "Do I need to pre-register?",
        "Do I need to pre register?"
      ],
      "responses": [
        "Pre-registration gives the students an easier and faster enrollment process. Classes are reserved for them."
      ]
    },
    {
      "tag": "reserve",
      "patterns": [
        "Why do I need to reserve slots",
        "Is reservation important?",
        "Should I reserve slots?"
      ],
      "responses": [
        "During enrollment, each class reaches the maximum number of students. The schedule you desire may be full by the time you enroll if you do not pre-register."
      ]
    },
    {
      "tag": "regular student",
      "patterns": [
        "What is a regular student?",
        "Define a regular student?",
        "Who is a regular student?",
        "Regular student requirements"
      ],
      "responses": [
        "A regular student is one who is enrolled in the total number of units prescribed in the curriculum."
      ]
    },
    {
      "tag": "shift",
      "patterns": [
        "When can I shift to another course",
        "Is shifting possible?",
        "Will I be able to shift?",
        "What do I need to shift?",
        "Shifting Requirements?",
        "How can I shift?"
      ],
      "responses": [
        "Freshmen are allowed to shift by the end of the First Semester. Upperclassmen may shift at the end of the current semester when grades become available. You may reach out to the registrar's office for detailed list of requirements."
      ]
    },
    {
      "tag": "where grades?",
      "patterns": [
        "If I have a question about my curriculum or grades, where do I go?",
        "Where are my grades?",
        "Where will I ask about my grades?",
        "Where can I see my grades?",
        "If I have a question about my curriculum or grades, where do I go?"
      ],
      "responses": [
        "You may address your questions to the office of the registrar or check your grades on your portal."
      ]
    },

    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
   
    {
      "tag": "pre-registration",
      "patterns": [
        "Why is there a need to pre-register?",
        "Pre-register",
        "Pre-registration"
      ],
      "responses": [
        "Pre-registration gives the students an easier and faster enrollment process. Classes are reserved for them."
      ]
    },
    {
      "tag": "reservation",
      "patterns": [
        "Why do I need to reserve slots?",
        "Reserve",
        "Reservation"
      ],
      "responses": [
        "During enrollment, each class reaches the maximum number of students. The schedule you desire may be full by the time you enroll if you do not pre-register."
      ]
    },
    {
      "tag": "regular student",
      "patterns": [
        "What is a regular student?",
        "Regular",
        "Regular Student"
      ],
      "responses": [
        "A regular student is one who is enrolled in the total number of units prescribed in the curriculum."
      ]
    },
    {
      "tag": "shift",
      "patterns": [
        "When can I shift to another course?",
        "Shifting",
        "Shift"
      ],
      "responses": [
        "Freshmen are allowed to shift by the end of the First Semester. Upperclassmen may shift at the end of the current semester when grades become available."
      ]
    },
    {
      "tag": "gone",
      "patterns": [
        "One of my pre-registered subjects is gone, what happened to it?",
        "Pre-registered subjects disappeared",
        "Can't find my pre-registered subjects"
      
      ],
      "responses": [
        "You might have failed the pre-requisite subject you have taken the previous semester or the faculty has not submitted your grade yet. Check your flowchart."
      ]
    },
    {
      "tag": "access registration",
      "patterns": [
        "I have already logged in on OnE, but I am unable to access the online registration, what do I do?",
        "Unable to access registration",
        "Unable to access online registration",
        "Can't access online registration",
        "Cannot access registration",
        "Cannot access online registration"

      ],
      "responses": [
        "These holds prevent you from enrolling in courses or viewing your grades but not from logging in. There are several reasons for your holds -- each with a different way or office to address or clear it. You must resolve your hold with the office that initiated it. For example, if you have a balance from your tuition and other fees, you will need to pay it and clear your account from the Student Accounts Section to have this hold removed."
      ]
    },
    {
      "tag": "program code and section code",
      "patterns": [
        "My COR says I'm an 'APM11' student, what does it mean?",
        "Program code and section code",
        "Program code",
        "Section code",
        "What is the meaning of APM11",
        "What is APM11"
      ],
      "responses": [
        "APM11 is your program code and section code. APM is the program code (progcode) for BS Applied Mathematics and 11 is the section code (sectcode) for freshmen, section 1. All programs in the University have assigned progcodes."
      ]
    },
    {
      "tag": "class standing",
      "patterns": [
        "I'm currently listed as a sophomore, but I should be listed as a junior, how do I change my class standing?",
        "Wrong class",
        "Wrong class standing",
        "Wrong section",
        "Wrong block",
        "Wrong year",
        "How can i change my class standing?",
        "How do I fix my class standing?"
      ],
      "responses": [
        "You have to go to the Records EvaluaTranscript of Records in charge of your program. For example, if you are a junior BS Biology student, go to the Office of the Registrar. Your records will be reviewed before changes are made."
      ]
    },
    {
      "tag": "transfer",
      "patterns": [
        "I currently belong to HUB21 but I would like to transfer to HUB22, how do I go about it?",
        "I want to switch sections",
        "I want to switch blocks",
        "I want to change classes",
        "How can I transfer sections?",
        "How do I transfer?"
      ],
      "responses": [
        "Submit a letter of request to change the section to the department where your program belongs. For example, if you are a BS Biology student, go to the Biological Sciences Department."
      ]
    },
    {
      "tag": "officially enrolled",
      "patterns": [
        "How can I confirm that I am officially enrolled in courses?",
        "Am I officially enrolled?",
        "Enrollment verification",
        "COR",
        "How can I verify my enrollment?",
        "How do I know if I am enrolled?"
      ],
      "responses": [
        "You will be able to print your COR and your name will appear on your professor's class list."
      ]
    },
    {
      "tag": "transaction 2",
      "patterns": [
        "My online registration shows Transaction 2, what is it?",
        "Transaction 2",
        "What is Transaction 2?",
        "What's Transaction 2"
      ],
      "responses": [
        "Transaction 2 is an updated version of your COR. This means you changed or added one or more subjects from your first transaction. Every change of registration means additional transactions."
      ]
    },
    {
      "tag": "online enrollment limit",
      "patterns": [
        "Is there a limit to online enrollment transactions?",
        "How many online enrollment transactions can I have?",
        "Online enrollment limit",
        "Transaction limit",
        "What is the limit of online enrollmet?",
        "What is the maximum number of online enrollment transactions?",
        "limit of online enrollment",
        "How many times can I enroll online?"
      ],
      "responses": [
        "Yes, the maximum is 3. However, on a case to case basis, a fourth transaction may be allowed. You need to pay a specific amount before you could proceed to Transaction 4."
      ]
    },
    {
      "tag": "cannot add subject",
      "patterns": [
        "Why is it that I can view the subjects in OnE, but, I can not add it to my registration?",
        "Can't add a subject to registration",
        "I cannot add my subject"
      ],
      "responses": [
        "Most of the time, the reason is that a particular subject is exclusive for other programs."
      ]
    },
    {
      "tag": "program code and section",
      "patterns": [
        "For example, I want to enroll in ENGL102, but, I can't search it. Why is it so?",
        "Can't find a specific program and section",
        "Can't find a program and section",
        "Can't find a program",
        "Can't find a section",
        "Can't find a class",
        "Cannot find a section",
        "Cannot find a class",
        "Cannot find a program"
        
      ],
      "responses": [
        "There are two possible reasons: it's either that specific subject is not offered for enrollment or you did not pass its pre-requisite subject. Some subjects have pre-requisites. Students must pass these subjects before enrolling."
      ]
    },
    {
      "tag": "name update",
      "patterns": [
        "How can I update my name?",
        "Name update",
        "How I change my name?",
        "My name is wrong.",
        "Wrong name"
      ],
      "responses": [
        "For name correction or change, submit a copy of the PSA-certified birth certificate and supporting document to the Records Section (Counter 2). Proceed to the ID Section (Counter 7)."
      ]
    },
    {
      "tag": "graduation application",
      "patterns": [
        "Do I have to apply for graduation?",
        "Graduation application",
        "Apply for graduation",
        "How can I apply for graduation?",
        "Where do I apply for gradution"
      ],
      "responses": [
        "Yes. You can get the application for graduation form from the Records EvaluaTranscript of Records assigned to your program."
      ]
    },
    {
      "tag": "graduation fee",
      "patterns": [
        "Is there a graduation fee?",
        "Graduation fee",
        "How much is the graduation fee?",
        "How much do I have to pay for graduation"
      ],
      "responses": [
        "Yes. Verify the amount at the Student Accounts Section."
      ]
    },
    {
      "tag": "pay w/o attendance",
      "patterns": [
        "Do I still have to pay the graduation fee if I will not attend the commencement ceremonies?",
        "I did not attend the commencement ceremonies. Do I still have to pay the graduation fee?",
        "Did not attend commence ceremonies. Do I still have to pay?",
        "Do I still have to pay my grad fee even if I did not attend",
        "no attendance"
      ],
      "responses": [
        "Yes. You still have to pay for the graduation fee."
      ]
    },
    {
      "tag": "graduation academic honors",
      "patterns": [
        "When will I know if I am graduating with academic honors?",
        "Am I graduating as an honor student?",
        "Graduation academic honors",
        "Student honor",
        "Honor"
      ],
      "responses": [
        "You will be notified a week before the graduation date by the Office of the Registrar."
      ]
    },
    {
      "tag": "entry cards/invitations graduation rites", 
      "patterns": [
        "Do I need entry cards and/or invitations for the Graduation Rites",
        "Entry cards for Graduation Rites",
        "Invitations for Graduation Rites"
      ],
      "responses": [
        "Yes. These will be given to you right after the general rehearsal."
      ]
    },
    {
      "tag": "graduate first semester or summer", 
      "patterns": [
        "If I am expecting to graduate in the first semester or summer term, when is the approximate time of my commencement ceremonies?",
        "Graduating in first semester",
        "Graduating in summer term"
      ],
      "responses": [
        "You will graduate with first Semester/summer Term commencement ceremonies, if there is a schedule."
      ]
    },
    {
      "tag": "commence ceremony schedule",
      "patterns": [
        "May I delay my participation and join the second semester commencement ceremonies?",
        "Delay participation and join second semester commencement ceremony",
        "Can I delay my commencement ceremony?"
      ],
      "responses": [
        "No. You may only participate in your scheduled term of commencement ceremonies."
      ]
    },
    {
      "tag": "Transcript of Records", 
      "patterns": [
        "Who can request for a transcript of records (Transcript of Records)?",
        "Can I request for my transcript of records?",
        "Can I request for my Transcript of Records?",
        "Can I view my Transcript of Records?",
        "Can I ask my Transcript of Records?",
        "Can I see my Transcript of Records?",
        "Get Transcript of Records",
        "Transcript of Records",
        "Can I get my Transcript of Records?",
        "Who can request for a TOR (TOR)?",
        "Can I request for my TOR?",
        "Can I request for my TOR?",
        "Can I view my TOR?",
        "Can I ask my TOR?",
        "Can I see my TOR?",
        "Get TOR",
        "TOR",
        "Can I get my TOR?",
        "Where is my TOR?",
        "Where can I get my TOR?"
      ],
      "responses": [
        "Any current or former student at De La Salle University-Dasmariñas can request for  TOR through the Office of the Registrar Counter 1."
      ]
    },
    {
      "tag": "electronic Transcript of Records",
      "patterns": [
        "Can I get an electronic version of my Transcript of Records?",
        "Can I view an electronic version of my Transcript of Records?",
        "Can I see an electronic version of my Transcript of Records?",
        "Digital Transcript of Records",
        "Is there a digital Transcript of Records?"
      ],
      "responses": [
        "No. Electronic Transcript of Recordss are not available."
      ]
    },
    {
      "tag": "unofficial Transcript of Records", 
      "patterns": [
        "Can I get an unofficial version of my Transcript of Records?",
        "Can I view an unofficial version of my Transcript of Records?",
        "Can I see an unofficial version of my Transcript of Records?",
        "Unofficial Transcript of Records",
        "View Transcript of Records",
        "unofficial"

      ],
      "responses": [
        "No. But you can view all of your grades online using the Student Portal."
      ]
    },
    {
      "tag": "requests Transcript of Records",
      "patterns": [
        "How many Transcript of Records can I request?",
        "Is there a limit to Transcript of Records requests?",
        "Transcript of Records limit"
      ],
      "responses": [
        "There is no limit."
      ]
    },
    {
      "tag": "schedule Transcript of Records",
      "patterns": [
        "How long will you hold my Transcript of Records until I or my authorized representative claims it?",
        "Schedule to get Transcript of Records"
      ],
      "responses": [
        "Six months from the scheduled release date."
      ]
    },
    {
      "tag": "hold Transcript of Records",
      "patterns": [
        "Can I request for Transcript of Records if there is a financial hold on my account?",
        "Can I see my Transript of Records while my account is on hold?",
        "Can I view my Transript of Records while my account is on hold?",
        "Can I get my Transript of Records while my account is on hold?"
      ],
      "responses": [
        "No. You must settle your financial obligation to the University before we can release your Transcript of Records."
      ]
    },
    {
      "tag": "diploma",
      "patterns": [
        "How do I get my diploma?",
        "Diploma",
        "I want to get my diploma"
      ],
      "responses": [
        "You must be cleared of all accountabilities from the University before you can get your diploma. Get a clearance form at the Office of the Registrar Counter 2."
      ]
    },
    {
      "tag": "lost diploma",
      "patterns": [
        "I lost my original diploma, can I request for another copy?",
        "Lost diploma. Can I get another copy?",
        "Can I get another copy of my diploma?"
      ],
      "responses": [
        "Yes. Submit an affidavit of loss to the Office of the Registrar Counter 1."
      ]
    },
    {
      "tag": "Parent's",
      "patterns": [
        "How can my parents access my records online?",
        "is there any way for my parents to get my records online?",
        "can my folks access my records online?",
        "how can my parents have online access to my records?",
        "parents access my online records",
        "rents access my online records",
        "get records online",
        "parents get my records",
        "ways for my parents to get my reocrds online"

      ],
      "responses": [
        "Through the Parent Portal. To access, your parent must have an active account, which can be acquired from the Information Technology and Communications Center (ICTC)."
      ]
    },
    {
      "tag": "data Registrar",
      "patterns": [
        "How can I get data from the Office of the Registrar for my school project (or thesis)?",
        "We want to ask the Registrar for data for our thesis"
      ],
      "responses": [
        "Submit a Request for Data form at the Office of the Registrar Counter 1. It has to be signed by your class adviser, department head, and college dean."
      ]
    },

    {
      "tag": "change grade",
      "patterns": [
        "What will I do if I already submitted the grades online, but, need to change the grade of a student?",
        "What to do if I want to change grades",
        "I want to change grades",
        "change grades",
        "already passsed the grade online but need to change grade",
        "what to do if I submitted my grade but need to change them?",
        "how to change my grades if i already submitted my grades online?",
        "I already gave my grades online but I need to change them how do i do that?",
        "passed grades online but need to change,how",
        "what to do if I passed my grades online but need to change them?"
      ],
      
      "responses": [
        "You must submit a Change of Grade form at the Office of the Registrar."
      ]
    },
    {
      "tag": "failed deadline",
      "patterns": [
        "I failed to encode the grades of my students online by the deadline for submission of grades, what I will do?",
	"What will I do if I did not encode my students grades online?",
	"I forgot to encode my grades of my students online",
	"Failed to encode grades",
	"Failed encode grades",
	"Fail grades encode",
	"grades fail encode"
      ],
      "responses": [
        "Use the Special Report of Grades form to physically submit the grades of your students at the Office of the Registrar."
      ]
    },
    {
      "tag": "students not in class",
      "patterns": [
        "One or more students attend my class, but their names are not in my class list, what will I do?",
	"A student attends but not in class list",
	"A student attends not in list",
	"A student is not in the list",
	"Student not in list"
      ],
      "responses": [
        "You must not allow them to continue attending your class."
      ]
    },
    {
      "tag": "Where to pay",
      "patterns": [
	      "Where do I make payments",
	      "Where to pay",
	      "Where pay",
	      "Payment where",
	      "Where do I go to pay my balance"
      ],
      "responses" :[
      	"All transactions are to be made in the accounting office"	
      ]
    },
    {
	 "tag": "When to pay?",
	 "patterns": [
	     "When to pay?",
	     "Is the accounting office open?",
	     "When is the accounting office open?"
	 ],
	 "responses": [
	      "The Accounting Office's operating hours are from 8am to 5pm, from Mondays to Saturdays."
	         ]
	}
    
  ]
}
